MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256GM310/mcu.h
extern volatile ODCDBITS ODCDbits __attribute__((__sfr__));

#define CNEND CNEND
extern volatile uint16_t CNEND __attribute__((__sfr__));
typedef struct tagCNENDBITS {
  uint16_t :1;
  uint16_t CNIED1:1;
  uint16_t CNIED2:1;
  uint16_t CNIED3:1;
  uint16_t CNIED4:1;
  uint16_t CNIED5:1;
  uint16_t CNIED6:1;
  uint16_t :1;
  uint16_t CNIED8:1;
  uint16_t :3;
  uint16_t CNIED12:1;
  uint16_t CNIED13:1;
  uint16_t CNIED14:1;
  uint16_t CNIED15:1;
} CNENDBITS;
extern volatile CNENDBITS CNENDbits __attribute__((__sfr__));

#define CNPUD CNPUD
extern volatile uint16_t CNPUD __attribute__((__sfr__));
typedef struct tagCNPUDBITS {
  uint16_t :1;
  uint16_t CNPUD1:1;
  uint16_t CNPUD2:1;
  uint16_t CNPUD3:1;
  uint16_t CNPUD4:1;
  uint16_t CNPUD5:1;
  uint16_t CNPUD6:1;
  uint16_t :1;
  uint16_t CNPUD8:1;
  uint16_t :3;
  uint16_t CNPUD12:1;
  uint16_t CNPUD13:1;
  uint16_t CNPUD14:1;
  uint16_t CNPUD15:1;
} CNPUDBITS;
extern volatile CNPUDBITS CNPUDbits __attribute__((__sfr__));

#define CNPDD CNPDD
extern volatile uint16_t CNPDD __attribute__((__sfr__));
typedef struct tagCNPDDBITS {
  uint16_t :1;
  uint16_t CNPDD1:1;
  uint16_t CNPDD2:1;
  uint16_t CNPDD3:1;
  uint16_t CNPDD4:1;
  uint16_t CNPDD5:1;
  uint16_t CNPDD6:1;
  uint16_t :1;
  uint16_t CNPDD8:1;
  uint16_t :3;
  uint16_t CNPDD12:1;
  uint16_t CNPDD13:1;
  uint16_t CNPDD14:1;
  uint16_t CNPDD15:1;
} CNPDDBITS;
extern volatile CNPDDBITS CNPDDbits __attribute__((__sfr__));

#define ANSELD ANSELD
extern volatile uint16_t ANSELD __attribute__((__sfr__));
typedef struct tagANSELDBITS {
  uint16_t :14;
  uint16_t ANSD14:1;
  uint16_t ANSD15:1;
} ANSELDBITS;
extern volatile ANSELDBITS ANSELDbits __attribute__((__sfr__));

#define TRISE TRISE
extern volatile uint16_t TRISE __attribute__((__sfr__));
typedef struct tagTRISEBITS {
  uint16_t TRISE0:1;
  uint16_t TRISE1:1;
  uint16_t :6;
  uint16_t TRISE8:1;
  uint16_t TRISE9:1;
  uint16_t :2;
  uint16_t TRISE12:1;
  uint16_t TRISE13:1;
  uint16_t TRISE14:1;
  uint16_t TRISE15:1;
} TRISEBITS;
extern volatile TRISEBITS TRISEbits __attribute__((__sfr__));

#define PORTE PORTE
extern volatile uint16_t PORTE __attribute__((__sfr__));
typedef struct tagPORTEBITS {
  uint16_t RE0:1;
  uint16_t RE1:1;
  uint16_t :6;
  uint16_t RE8:1;
  uint16_t RE9:1;
  uint16_t :2;
  uint16_t RE12:1;
  uint16_t RE13:1;
  uint16_t RE14:1;
  uint16_t RE15:1;
} PORTEBITS;
extern volatile PORTEBITS PORTEbits __attribute__((__sfr__));

#define LATE LATE
extern volatile uint16_t LATE __attribute__((__sfr__));
typedef struct tagLATEBITS {
  uint16_t LATE0:1;
  uint16_t LATE1:1;
  uint16_t :6;
  uint16_t LATE8:1;
  uint16_t LATE9:1;
  uint16_t :2;
  uint16_t LATE12:1;
  uint16_t LATE13:1;
  uint16_t LATE14:1;
  uint16_t LATE15:1;
} LATEBITS;
extern volatile LATEBITS LATEbits __attribute__((__sfr__));

#define ODCE ODCE
extern volatile uint16_t ODCE __attribute__((__sfr__));
typedef struct tagODCEBITS {
  uint16_t ODCE0:1;
  uint16_t ODCE1:1;
  uint16_t :6;
  uint16_t ODCE8:1;
  uint16_t ODCE9:1;
  uint16_t :2;
  uint16_t ODCE12:1;
  uint16_t ODCE13:1;
  uint16_t ODCE14:1;
  uint16_t ODCE15:1;
} ODCEBITS;
extern volatile ODCEBITS ODCEbits __attribute__((__sfr__));

#define CNENE CNENE
extern volatile uint16_t CNENE __attribute__((__sfr__));
typedef struct tagCNENEBITS {
  uint16_t CNIEE0:1;
  uint16_t CNIEE1:1;
  uint16_t :6;
  uint16_t CNIEE8:1;
  uint16_t CNIEE9:1;
  uint16_t :2;
  uint16_t CNIEE12:1;
  uint16_t CNIEE13:1;
  uint16_t CNIEE14:1;
  uint16_t CNIEE15:1;
} CNENEBITS;
extern volatile CNENEBITS CNENEbits __attribute__((__sfr__));

#define CNPUE CNPUE
extern volatile uint16_t CNPUE __attribute__((__sfr__));
typedef struct tagCNPUEBITS {
  uint16_t CNPUE0:1;
  uint16_t CNPUE1:1;
  uint16_t :6;
  uint16_t CNPUE8:1;
  uint16_t CNPUE9:1;
  uint16_t :2;
  uint16_t CNPUE12:1;
  uint16_t CNPUE13:1;
  uint16_t CNPUE14:1;
  uint16_t CNPUE15:1;
} CNPUEBITS;
extern volatile CNPUEBITS CNPUEbits __attribute__((__sfr__));

#define CNPDE CNPDE
extern volatile uint16_t CNPDE __attribute__((__sfr__));
typedef struct tagCNPDEBITS {
  uint16_t CNPDE0:1;
  uint16_t CNPDE1:1;
  uint16_t :6;
  uint16_t CNPDE8:1;
  uint16_t CNPDE9:1;
  uint16_t :2;
  uint16_t CNPDE12:1;
  uint16_t CNPDE13:1;
  uint16_t CNPDE14:1;
  uint16_t CNPDE15:1;
} CNPDEBITS;
extern volatile CNPDEBITS CNPDEbits __attribute__((__sfr__));

#define ANSELE ANSELE
extern volatile uint16_t ANSELE __attribute__((__sfr__));
typedef struct tagANSELEBITS {
  uint16_t ANSE0:1;
  uint16_t ANSE1:1;
  uint16_t :6;
  uint16_t ANSE8:1;
  uint16_t ANSE9:1;
  uint16_t :2;
  uint16_t ANSE12:1;
  uint16_t ANSE13:1;
  uint16_t ANSE14:1;
  uint16_t ANSE15:1;
} ANSELEBITS;
extern volatile ANSELEBITS ANSELEbits __attribute__((__sfr__));

#define TRISF TRISF
extern volatile uint16_t TRISF __attribute__((__sfr__));
typedef struct tagTRISFBITS {
  uint16_t TRISF0:1;
  uint16_t TRISF1:1;
  uint16_t :2;
  uint16_t TRISF4:1;
  uint16_t TRISF5:1;
  uint16_t TRISF6:1;
  uint16_t TRISF7:1;
  uint16_t :1;
  uint16_t TRISF9:1;
  uint16_t TRISF10:1;
  uint16_t :1;
  uint16_t TRISF12:1;
  uint16_t TRISF13:1;
} TRISFBITS;
extern volatile TRISFBITS TRISFbits __attribute__((__sfr__));

#define PORTF PORTF
extern volatile uint16_t PORTF __attribute__((__sfr__));
typedef struct tagPORTFBITS {
  uint16_t RF0:1;
  uint16_t RF1:1;
  uint16_t :2;
  uint16_t RF4:1;
  uint16_t RF5:1;
  uint16_t RF6:1;
  uint16_t RF7:1;
  uint16_t :1;
  uint16_t RF9:1;
  uint16_t RF10:1;
  uint16_t :1;
  uint16_t RF12:1;
  uint16_t RF13:1;
} PORTFBITS;
extern volatile PORTFBITS PORTFbits __attribute__((__sfr__));

#define LATF LATF
extern volatile uint16_t LATF __attribute__((__sfr__));
typedef struct tagLATFBITS {
  uint16_t LATF0:1;
  uint16_t LATF1:1;
  uint16_t :2;
  uint16_t LATF4:1;
  uint16_t LATF5:1;
  uint16_t LATF6:1;
  uint16_t LATF7:1;
  uint16_t :1;
  uint16_t LATF9:1;
  uint16_t LATF10:1;
  uint16_t :1;
  uint16_t LATF12:1;
  uint16_t LATF13:1;
} LATFBITS;
extern volatile LATFBITS LATFbits __attribute__((__sfr__));

#define ODCF ODCF
extern volatile uint16_t ODCF __attribute__((__sfr__));
typedef struct tagODCFBITS {
  uint16_t ODCF0:1;
  uint16_t ODCF1:1;
  uint16_t :2;
  uint16_t ODCF4:1;
  uint16_t ODCF5:1;
  uint16_t ODCF6:1;
  uint16_t ODCF7:1;
  uint16_t :1;
  uint16_t ODCF9:1;
  uint16_t ODCF10:1;
  uint16_t :1;
  uint16_t ODCF12:1;
  uint16_t ODCF13:1;
} ODCFBITS;
extern volatile ODCFBITS ODCFbits __attribute__((__sfr__));

