MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256GM310/mcu.h
/* AD2CSSH */
/* Bitname _CSS16 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS17 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS18 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS19 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS20 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS21 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS22 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS23 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS24 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS25 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS26 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS27 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS28 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS29 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS30 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS31 cannot be defined because it is used by more than one SFR */

/* AD2CSSL */
/* Bitname _CSS0 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS1 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS2 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS3 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS4 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS5 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS6 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS7 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS8 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS9 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS10 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS11 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS12 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS13 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS14 cannot be defined because it is used by more than one SFR */
/* Bitname _CSS15 cannot be defined because it is used by more than one SFR */

/* AD2CON4 */
/* Bitname _DMABL cannot be defined because it is used by more than one SFR */
/* Bitname _ADDMAEN cannot be defined because it is used by more than one SFR */
/* Bitname _DMABL0 cannot be defined because it is used by more than one SFR */
/* Bitname _DMABL1 cannot be defined because it is used by more than one SFR */
/* Bitname _DMABL2 cannot be defined because it is used by more than one SFR */

/* QEI2CON */
/* Bitname _CCM cannot be defined because it is used by more than one SFR */
/* Bitname _GATEN cannot be defined because it is used by more than one SFR */
/* Bitname _CNTPOL cannot be defined because it is used by more than one SFR */
/* Bitname _INTDIV cannot be defined because it is used by more than one SFR */
/* Bitname _IMV cannot be defined because it is used by more than one SFR */
/* Bitname _PIMOD cannot be defined because it is used by more than one SFR */
/* Bitname _QEISIDL cannot be defined because it is used by more than one SFR */
/* Bitname _QEIEN cannot be defined because it is used by more than one SFR */

/* QEI2IOC */
/* Bitname _QEA cannot be defined because it is used by more than one SFR */
/* Bitname _QEB cannot be defined because it is used by more than one SFR */
/* Bitname _INDEX cannot be defined because it is used by more than one SFR */
/* Bitname _HOME cannot be defined because it is used by more than one SFR */
/* Bitname _QEAPOL cannot be defined because it is used by more than one SFR */
/* Bitname _QEBPOL cannot be defined because it is used by more than one SFR */
/* Bitname _IDXPOL cannot be defined because it is used by more than one SFR */
/* Bitname _HOMPOL cannot be defined because it is used by more than one SFR */
/* Bitname _SWPAB cannot be defined because it is used by more than one SFR */
/* Bitname _OUTFNC cannot be defined because it is used by more than one SFR */
/* Bitname _QFDIV cannot be defined because it is used by more than one SFR */
/* Bitname _FLTREN cannot be defined because it is used by more than one SFR */
/* Bitname _QCAPEN cannot be defined because it is used by more than one SFR */

/* QEI2STAT */
/* Bitname _IDXIEN cannot be defined because it is used by more than one SFR */
/* Bitname _IDXIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _HOMIEN cannot be defined because it is used by more than one SFR */
/* Bitname _HOMIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _VELOVIEN cannot be defined because it is used by more than one SFR */
/* Bitname _VELOVIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _PCIIEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCIIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _POSOVIEN cannot be defined because it is used by more than one SFR */
/* Bitname _POSOVIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _PCLEQIEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCLEQIRQ cannot be defined because it is used by more than one SFR */
/* Bitname _PCHEQIEN cannot be defined because it is used by more than one SFR */
/* Bitname _PCHEQIRQ cannot be defined because it is used by more than one SFR */

/* PMCON */
#define _RDSP PMCONbits.RDSP
#define _WRSP PMCONbits.WRSP
#define _BEP PMCONbits.BEP
#define _CS1P PMCONbits.CS1P
#define _CS2P PMCONbits.CS2P
#define _ALP PMCONbits.ALP
#define _CSF PMCONbits.CSF
#define _PTRDEN PMCONbits.PTRDEN
#define _PTWREN PMCONbits.PTWREN
#define _PTBEEN PMCONbits.PTBEEN
#define _ADRMUX PMCONbits.ADRMUX
/* Bitname _PSIDL cannot be defined because it is used by more than one SFR */
#define _PMPEN PMCONbits.PMPEN
#define _CSF0 PMCONbits.CSF0
#define _CSF1 PMCONbits.CSF1
#define _ADRMUX0 PMCONbits.ADRMUX0
#define _ADRMUX1 PMCONbits.ADRMUX1

