MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256GM310/mcu.h
#define _CTMUCON2_EDG2STAT_POSITION              0x00000009
#define _CTMUCON2_EDG2STAT_MASK                  0x00000200
#define _CTMUCON2_EDG2STAT_LENGTH                0x00000001

#define _CTMUCON2_EDG1SEL_POSITION               0x0000000A
#define _CTMUCON2_EDG1SEL_MASK                   0x00003C00
#define _CTMUCON2_EDG1SEL_LENGTH                 0x00000004

#define _CTMUCON2_EDG1POL_POSITION               0x0000000E
#define _CTMUCON2_EDG1POL_MASK                   0x00004000
#define _CTMUCON2_EDG1POL_LENGTH                 0x00000001

#define _CTMUCON2_EDG1MOD_POSITION               0x0000000F
#define _CTMUCON2_EDG1MOD_MASK                   0x00008000
#define _CTMUCON2_EDG1MOD_LENGTH                 0x00000001

#define _CTMUCON2_EDG2SEL0_POSITION              0x00000002
#define _CTMUCON2_EDG2SEL0_MASK                  0x00000004
#define _CTMUCON2_EDG2SEL0_LENGTH                0x00000001

#define _CTMUCON2_EDG2SEL1_POSITION              0x00000003
#define _CTMUCON2_EDG2SEL1_MASK                  0x00000008
#define _CTMUCON2_EDG2SEL1_LENGTH                0x00000001

#define _CTMUCON2_EDG2SEL2_POSITION              0x00000004
#define _CTMUCON2_EDG2SEL2_MASK                  0x00000010
#define _CTMUCON2_EDG2SEL2_LENGTH                0x00000001

#define _CTMUCON2_EDG2SEL3_POSITION              0x00000005
#define _CTMUCON2_EDG2SEL3_MASK                  0x00000020
#define _CTMUCON2_EDG2SEL3_LENGTH                0x00000001

#define _CTMUCON2_EDG1SEL0_POSITION              0x0000000A
#define _CTMUCON2_EDG1SEL0_MASK                  0x00000400
#define _CTMUCON2_EDG1SEL0_LENGTH                0x00000001

#define _CTMUCON2_EDG1SEL1_POSITION              0x0000000B
#define _CTMUCON2_EDG1SEL1_MASK                  0x00000800
#define _CTMUCON2_EDG1SEL1_LENGTH                0x00000001

#define _CTMUCON2_EDG1SEL2_POSITION              0x0000000C
#define _CTMUCON2_EDG1SEL2_MASK                  0x00001000
#define _CTMUCON2_EDG1SEL2_LENGTH                0x00000001

#define _CTMUCON2_EDG1SEL3_POSITION              0x0000000D
#define _CTMUCON2_EDG1SEL3_MASK                  0x00002000
#define _CTMUCON2_EDG1SEL3_LENGTH                0x00000001

#define _CTMUICON_IRNG_POSITION                  0x00000008
#define _CTMUICON_IRNG_MASK                      0x00000300
#define _CTMUICON_IRNG_LENGTH                    0x00000002

#define _CTMUICON_ITRIM_POSITION                 0x0000000A
#define _CTMUICON_ITRIM_MASK                     0x0000FC00
#define _CTMUICON_ITRIM_LENGTH                   0x00000006

#define _CTMUICON_IRNG0_POSITION                 0x00000008
#define _CTMUICON_IRNG0_MASK                     0x00000100
#define _CTMUICON_IRNG0_LENGTH                   0x00000001

#define _CTMUICON_IRNG1_POSITION                 0x00000009
#define _CTMUICON_IRNG1_MASK                     0x00000200
#define _CTMUICON_IRNG1_LENGTH                   0x00000001

#define _CTMUICON_ITRIM0_POSITION                0x0000000A
#define _CTMUICON_ITRIM0_MASK                    0x00000400
#define _CTMUICON_ITRIM0_LENGTH                  0x00000001

#define _CTMUICON_ITRIM1_POSITION                0x0000000B
#define _CTMUICON_ITRIM1_MASK                    0x00000800
#define _CTMUICON_ITRIM1_LENGTH                  0x00000001

#define _CTMUICON_ITRIM2_POSITION                0x0000000C
#define _CTMUICON_ITRIM2_MASK                    0x00001000
#define _CTMUICON_ITRIM2_LENGTH                  0x00000001

#define _CTMUICON_ITRIM3_POSITION                0x0000000D
#define _CTMUICON_ITRIM3_MASK                    0x00002000
#define _CTMUICON_ITRIM3_LENGTH                  0x00000001

#define _CTMUICON_ITRIM4_POSITION                0x0000000E
#define _CTMUICON_ITRIM4_MASK                    0x00004000
#define _CTMUICON_ITRIM4_LENGTH                  0x00000001

#define _CTMUICON_ITRIM5_POSITION                0x0000000F
#define _CTMUICON_ITRIM5_MASK                    0x00008000
#define _CTMUICON_ITRIM5_LENGTH                  0x00000001

#define _AD2CON1_DONE_POSITION                   0x00000000
#define _AD2CON1_DONE_MASK                       0x00000001
#define _AD2CON1_DONE_LENGTH                     0x00000001

#define _AD2CON1_SAMP_POSITION                   0x00000001
#define _AD2CON1_SAMP_MASK                       0x00000002
#define _AD2CON1_SAMP_LENGTH                     0x00000001

#define _AD2CON1_ASAM_POSITION                   0x00000002
#define _AD2CON1_ASAM_MASK                       0x00000004
#define _AD2CON1_ASAM_LENGTH                     0x00000001

#define _AD2CON1_SIMSAM_POSITION                 0x00000003
#define _AD2CON1_SIMSAM_MASK                     0x00000008
#define _AD2CON1_SIMSAM_LENGTH                   0x00000001

#define _AD2CON1_SSRCG_POSITION                  0x00000004
#define _AD2CON1_SSRCG_MASK                      0x00000010
#define _AD2CON1_SSRCG_LENGTH                    0x00000001

#define _AD2CON1_SSRC_POSITION                   0x00000005
#define _AD2CON1_SSRC_MASK                       0x000000E0
#define _AD2CON1_SSRC_LENGTH                     0x00000003

#define _AD2CON1_FORM_POSITION                   0x00000008
#define _AD2CON1_FORM_MASK                       0x00000300
#define _AD2CON1_FORM_LENGTH                     0x00000002

#define _AD2CON1_AD12B_POSITION                  0x0000000A
#define _AD2CON1_AD12B_MASK                      0x00000400
#define _AD2CON1_AD12B_LENGTH                    0x00000001

#define _AD2CON1_ADDMABM_POSITION                0x0000000C
#define _AD2CON1_ADDMABM_MASK                    0x00001000
#define _AD2CON1_ADDMABM_LENGTH                  0x00000001

#define _AD2CON1_ADSIDL_POSITION                 0x0000000D
#define _AD2CON1_ADSIDL_MASK                     0x00002000
#define _AD2CON1_ADSIDL_LENGTH                   0x00000001

#define _AD2CON1_ADON_POSITION                   0x0000000F
#define _AD2CON1_ADON_MASK                       0x00008000
#define _AD2CON1_ADON_LENGTH                     0x00000001

#define _AD2CON1_SSRC0_POSITION                  0x00000005
#define _AD2CON1_SSRC0_MASK                      0x00000020
#define _AD2CON1_SSRC0_LENGTH                    0x00000001

#define _AD2CON1_SSRC1_POSITION                  0x00000006
#define _AD2CON1_SSRC1_MASK                      0x00000040
#define _AD2CON1_SSRC1_LENGTH                    0x00000001

#define _AD2CON1_SSRC2_POSITION                  0x00000007
#define _AD2CON1_SSRC2_MASK                      0x00000080
#define _AD2CON1_SSRC2_LENGTH                    0x00000001

#define _AD2CON1_FORM0_POSITION                  0x00000008
#define _AD2CON1_FORM0_MASK                      0x00000100
#define _AD2CON1_FORM0_LENGTH                    0x00000001

#define _AD2CON1_FORM1_POSITION                  0x00000009
#define _AD2CON1_FORM1_MASK                      0x00000200
#define _AD2CON1_FORM1_LENGTH                    0x00000001

#define _AD2CON2_ALTS_POSITION                   0x00000000
#define _AD2CON2_ALTS_MASK                       0x00000001
#define _AD2CON2_ALTS_LENGTH                     0x00000001

#define _AD2CON2_BUFM_POSITION                   0x00000001
#define _AD2CON2_BUFM_MASK                       0x00000002
#define _AD2CON2_BUFM_LENGTH                     0x00000001

#define _AD2CON2_SMPI_POSITION                   0x00000002
#define _AD2CON2_SMPI_MASK                       0x0000007C
#define _AD2CON2_SMPI_LENGTH                     0x00000005

#define _AD2CON2_BUFS_POSITION                   0x00000007
#define _AD2CON2_BUFS_MASK                       0x00000080
#define _AD2CON2_BUFS_LENGTH                     0x00000001

#define _AD2CON2_CHPS_POSITION                   0x00000008
#define _AD2CON2_CHPS_MASK                       0x00000300
#define _AD2CON2_CHPS_LENGTH                     0x00000002

#define _AD2CON2_CSCNA_POSITION                  0x0000000A
#define _AD2CON2_CSCNA_MASK                      0x00000400
#define _AD2CON2_CSCNA_LENGTH                    0x00000001

